/*

	Custom objects

*/

/*

	Other

*/
	CreateDynamicObject(13593, 2170.439453, -1512.586963, 23.547224, 0.0, 0.0, 180.0); // трамплин в рекламный щит

/*

	Bus Stations

*/
	CreateDynamicObject(1257,1815.967,1134.804,7.109,0.0,0.0,0.0);
	CreateDynamicObject(1257,1816.475,1452.835,7.146,0.0,0.0,0.0);
	CreateDynamicObject(1257,1885.619,1725.733,11.095,0.0,0.0,4.297);
	CreateDynamicObject(1257,1778.701,2270.615,5.711,0.0,0.0,-180.000);
	CreateDynamicObject(1257,1708.955,1725.701,10.987,0.0,0.0,-180.000);
	CreateDynamicObject(1257,1738.593,1601.745,10.478,0.0,0.0,-15.625);
	CreateDynamicObject(1257,1683.623,1126.710,11.100,0.0,0.0,-90.077);
	CreateDynamicObject(1257,2013.780,946.675,11.100,0.0,0.0,-0.077);
	CreateDynamicObject(1257,-1985.684,149.068,27.967,0.0,0.0,-0.077);
	CreateDynamicObject(1257,-1995.412,312.518,35.451,0.0,0.0,-0.077);
	CreateDynamicObject(1257,-1861.582,595.783,35.451,0.0,0.0,-90.077);
	CreateDynamicObject(1257,-1703.272,676.508,25.170,0.0,0.0,-0.077);
	CreateDynamicObject(1257,-1704.162,867.978,25.162,0.0,0.0,-0.077);
	CreateDynamicObject(1257,-1704.110,1025.104,45.490,0.0,0.0,-0.077);
	CreateDynamicObject(1257,-1746.517,1197.267,25.399,0.0,0.0,89.923);
	CreateDynamicObject(1257,-1910.818,1186.836,45.725,0.0,0.0,89.923);
	CreateDynamicObject(1257,-2119.103,1187.030,55.850,0.0,0.0,89.923);
	CreateDynamicObject(1257,-2275.390,1087.410,80.287,0.0,0.0,179.923);
	CreateDynamicObject(1257,-2275.105,922.272,66.928,0.0,0.0,179.923);
	CreateDynamicObject(1257,-2275.275,734.438,49.725,0.0,0.0,179.923);
	CreateDynamicObject(1257,-2210.412,557.038,35.451,0.0,0.0,269.923);
	CreateDynamicObject(1257,-2064.466,557.000,35.451,0.0,0.0,269.923);
	CreateDynamicObject(1257,-2014.789,414.333,35.451,0.0,0.0,179.923);
	CreateDynamicObject(1257,-2014.412,186.169,27.967,0.0,0.0,179.923);
	CreateDynamicObject(1257,-2132.080,116.665,35.600,0.0,0.0,89.923);
	CreateDynamicObject(1257,-2173.565,6.325,35.600,0.0,0.0,179.923);
	CreateDynamicObject(1257,-2140.701,-76.514,35.600,0.0,0.0,269.923);
	CreateDynamicObject(1257,-2026.529,-76.771,35.600,0.0,0.0,269.923);
	CreateDynamicObject(1257,-2245.663,-133.715,35.600,0.0,0.0,-0.077);
	CreateDynamicObject(1257,-2245.524,8.077,35.600,0.0,0.0,-0.077);
	CreateDynamicObject(1257,-2245.619,220.796,35.600,0.0,0.0,-0.077);
	CreateDynamicObject(1257,-2285.647,406.988,35.451,0.0,0.0,44.923);
	CreateDynamicObject(1257,-2428.460,122.073,35.451,0.0,0.0,179.923);
	CreateDynamicObject(1257,-2598.402,101.784,4.615,0.0,0.0,-0.077);
	CreateDynamicObject(1257,-2613.834,212.014,5.372,7.735,0.0,-90.077);
	CreateDynamicObject(1257,-2533.954,362.251,20.543,2.578,0.0,0.0);

/*

	OG Loc's House

*/

	CreateDynamicObject(19448, 516.84509, -6.61930, 1002.30701,   0.00000, 0.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19448, 515.21973, -6.61820, 1002.29102,   0.00000, 0.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19448, 521.57648, -11.51950, 1002.29279,   0.00000, 0.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19448, 510.31931, -11.34760, 1002.30682,   0.00000, 0.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19448, 513.97278, -11.34100, 1004.16010,   0.00000, 90.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19448, 511.98111, -11.34330, 1004.16010,   0.00000, 90.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19448, 517.20227, -11.33950, 1004.16010,   0.00000, 90.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19448, 519.91321, -11.33920, 1004.16010,   0.00000, 90.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19448, 520.23248, -15.83100, 1002.33099,   0.00000, 0.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19448, 516.68103, -8.42310, 1000.47211,   0.00000, 90.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19448, 515.11432, -8.42190, 1000.47211,   0.00000, 90.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19448, 519.90430, -11.18960, 1000.47119,   0.00000, 90.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19448, 520.23492, -14.32430, 1000.46973,   0.00000, 90.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19448, 515.03961, -17.90180, 1004.15662,   0.00000, 90.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19448, 515.03668, -18.63490, 1004.16461,   0.00000, 90.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19448, 510.31339, -15.55370, 1002.35260,   0.00000, 0.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19448, 515.49017, -20.58050, 1002.31372,   0.00000, 0.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19448, 515.03668, -18.63490, 1000.47461,   0.00000, 90.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19448, 519.51038, -19.72450, 1002.27081,   0.00000, 0.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19448, 510.38751, -21.78100, 1002.29688,   0.00000, 0.00000, 115.00000, .interiorid = 3);
	CreateDynamicObject(19448, 508.37259, -20.48530, 1002.32727,   0.00000, 0.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19448, 507.27802, -18.38980, 1002.20020,   0.00000, 0.00000, -115.00000, .interiorid = 3);

/*

	Sweet's House

*/

	CreateDynamicObject(19448, 2530.53833, -1685.53943, 1018.08899,   0.00000, 90.00000, 90.00000, .interiorid = 1);
	CreateDynamicObject(19448, 2530.53564, -1682.44153, 1018.09058,   0.00000, 90.00000, 90.00000, .interiorid = 1);

/*

	B-Dup's

*/

	CreateDynamicObject(19448, 1532.03394, -11.12470, 1003.68030,   0.00000, 90.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19448, 1528.54883, -11.12260, 1003.68030,   0.00000, 90.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19448, 1525.09167, -11.11510, 1003.66431,   0.00000, 90.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19448, 1532.49707, -9.38400, 1001.90692,   0.00000, 0.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19448, 1527.78540, -14.29040, 1001.91351,   0.00000, 0.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19325, 1528.58679, -14.17460, 1001.31732,   0.00000, 0.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19325, 1521.94434, -14.17430, 1001.31360,   0.00000, 0.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19448, 1527.76599, -6.29200, 1001.90363,   0.00000, 0.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19325, 1526.97937, -6.40110, 1001.57617,   0.00000, 0.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19448, 1524.94641, -14.13200, 1001.91412,   0.00000, 0.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19448, 1520.31384, -8.59920, 1001.91663,   0.00000, 0.00000, 80.00000, .interiorid = 3);
	CreateDynamicObject(19448, 1523.61572, -11.02690, 1001.91852,   0.00000, 0.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19448, 1529.30591, -16.98020, 1001.93103,   0.00000, 0.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19448, 1529.30566, -15.30050, 1004.85681,   0.00000, 0.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19880, 1530.22168, -6.45190, 1004.09412,   0.00000, 0.00000, 90.00000, .interiorid = 3);

/*

	B-Dup's Crack Palace

*/

	CreateDynamicObject(19448, 1520.16589, -46.15970, 1002.84613,   0.00000, 0.00000, 0.00000, .interiorid = 2);
	CreateDynamicObject(19448, 1520.16577, -46.14370, 1003.44281,   0.00000, 0.00000, 0.00000, .interiorid = 2);
	CreateDynamicObject(19448, 1520.16455, -46.33200, 1002.84637,   0.00000, 0.00000, 0.00000, .interiorid = 2);
	CreateDynamicObject(19448, 1520.16455, -46.32400, 1003.45367,   0.00000, 0.00000, 0.00000, .interiorid = 2);
	CreateDynamicObject(19448, 1524.89355, -51.23010, 1002.85162,   0.00000, 0.00000, 90.00000, .interiorid = 2);
	CreateDynamicObject(19448, 1524.89355, -51.23010, 1003.45477,   0.00000, 0.00000, 90.00000, .interiorid = 2);
	CreateDynamicObject(19448, 1528.06201, -46.31140, 1002.83972,   0.00000, 0.00000, 0.00000, .interiorid = 2);
	CreateDynamicObject(19448, 1528.06177, -46.31140, 1003.45062,   0.00000, 0.00000, 0.00000, .interiorid = 2);
	CreateDynamicObject(19448, 1528.06653, -45.95580, 1002.84308,   0.00000, 0.00000, 0.00000, .interiorid = 2);
	CreateDynamicObject(19448, 1528.06653, -45.95580, 1003.45477,   0.00000, 0.00000, 0.00000, .interiorid = 2);
	CreateDynamicObject(1567, 1527.99817, -48.75430, 1001.08362,   0.00000, 0.00000, 90.00000, .interiorid = 2);
	CreateDynamicObject(19448, 1526.23096, -46.21750, 1005.25549,   0.00000, 90.00000, 0.00000, .interiorid = 2);
	CreateDynamicObject(19448, 1522.80676, -46.22480, 1005.25549,   0.00000, 90.00000, 0.00000, .interiorid = 2);
	CreateDynamicObject(19448, 1521.82837, -46.21860, 1005.25549,   0.00000, 90.00000, 0.00000, .interiorid = 2);
	CreateDynamicObject(19448, 1523.09705, -41.23540, 1002.82428,   0.00000, 0.00000, 90.00000, .interiorid = 2);
	CreateDynamicObject(19448, 1523.09705, -41.23540, 1003.60577,   0.00000, 0.00000, 90.00000, .interiorid = 2);
	CreateDynamicObject(14638, 1520.21606, -48.74120, 1001.08960,   0.00000, 0.00000, 0.00000, .interiorid = 2);

/*

	Blastin' Fools Records

*/

	CreateDynamicObject(19463, 1035.94336, 0.02330, 1002.01141,   0.00000, 0.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19463, 1035.93994, 7.26710, 1002.01141,   0.00000, 0.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19463, 1037.60791, 0.03760, 1003.80560,   0.00000, 90.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19463, 1038.61621, 0.03710, 1003.80560,   0.00000, 90.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19463, 1040.69348, 10.45770, 1003.80969,   0.00000, 90.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19463, 1040.70642, 6.96977, 1003.80969,   0.00000, 90.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19463, 1040.67444, 12.14480, 1002.01422,   0.00000, 0.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19463, 1040.68872, 6.55770, 1003.80969,   0.00000, 90.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19463, 1040.30225, 0.07010, 1002.03540,   0.00000, 0.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19463, 1040.69812, -4.83550, 1002.03821,   0.00000, 0.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19463, 1040.30286, 3.63280, 1002.03540,   0.00000, 0.00000, 0.00000, .interiorid = 3);
	CreateDynamicObject(19463, 1045.03125, 8.36150, 1002.03821,   0.00000, 0.00000, 90.00000, .interiorid = 3);
	CreateDynamicObject(19463, 1044.55054, 7.40000, 1002.03540,   0.00000, 0.00000, 0.00000, .interiorid = 3);
